GopalSaraf/Practicals/PSDL/include/proc/pic16f17126.inc
// Register: RC0I2C
#define RC0I2C RC0I2C
RC0I2C                                   equ 01EE9h
// bitfield definitions
RC0I2C_TH_POSN                           equ 0000h
RC0I2C_TH_POSITION                       equ 0000h
RC0I2C_TH_SIZE                           equ 0002h
RC0I2C_TH_LENGTH                         equ 0002h
RC0I2C_TH_MASK                           equ 0003h
RC0I2C_PU_POSN                           equ 0004h
RC0I2C_PU_POSITION                       equ 0004h
RC0I2C_PU_SIZE                           equ 0002h
RC0I2C_PU_LENGTH                         equ 0002h
RC0I2C_PU_MASK                           equ 0030h
RC0I2C_SLEW_POSN                         equ 0006h
RC0I2C_SLEW_POSITION                     equ 0006h
RC0I2C_SLEW_SIZE                         equ 0002h
RC0I2C_SLEW_LENGTH                       equ 0002h
RC0I2C_SLEW_MASK                         equ 00C0h
RC0I2C_TH0_POSN                          equ 0000h
RC0I2C_TH0_POSITION                      equ 0000h
RC0I2C_TH0_SIZE                          equ 0001h
RC0I2C_TH0_LENGTH                        equ 0001h
RC0I2C_TH0_MASK                          equ 0001h
RC0I2C_TH1_POSN                          equ 0001h
RC0I2C_TH1_POSITION                      equ 0001h
RC0I2C_TH1_SIZE                          equ 0001h
RC0I2C_TH1_LENGTH                        equ 0001h
RC0I2C_TH1_MASK                          equ 0002h
RC0I2C_PU0_POSN                          equ 0004h
RC0I2C_PU0_POSITION                      equ 0004h
RC0I2C_PU0_SIZE                          equ 0001h
RC0I2C_PU0_LENGTH                        equ 0001h
RC0I2C_PU0_MASK                          equ 0010h
RC0I2C_PU1_POSN                          equ 0005h
RC0I2C_PU1_POSITION                      equ 0005h
RC0I2C_PU1_SIZE                          equ 0001h
RC0I2C_PU1_LENGTH                        equ 0001h
RC0I2C_PU1_MASK                          equ 0020h
RC0I2C_SLEW0_POSN                        equ 0006h
RC0I2C_SLEW0_POSITION                    equ 0006h
RC0I2C_SLEW0_SIZE                        equ 0001h
RC0I2C_SLEW0_LENGTH                      equ 0001h
RC0I2C_SLEW0_MASK                        equ 0040h
RC0I2C_SLEW1_POSN                        equ 0007h
RC0I2C_SLEW1_POSITION                    equ 0007h
RC0I2C_SLEW1_SIZE                        equ 0001h
RC0I2C_SLEW1_LENGTH                      equ 0001h
RC0I2C_SLEW1_MASK                        equ 0080h

// Register: RC1I2C
#define RC1I2C RC1I2C
RC1I2C                                   equ 01EEAh
// bitfield definitions
RC1I2C_TH_POSN                           equ 0000h
RC1I2C_TH_POSITION                       equ 0000h
RC1I2C_TH_SIZE                           equ 0002h
RC1I2C_TH_LENGTH                         equ 0002h
RC1I2C_TH_MASK                           equ 0003h
RC1I2C_PU_POSN                           equ 0004h
RC1I2C_PU_POSITION                       equ 0004h
RC1I2C_PU_SIZE                           equ 0002h
RC1I2C_PU_LENGTH                         equ 0002h
RC1I2C_PU_MASK                           equ 0030h
RC1I2C_SLEW_POSN                         equ 0006h
RC1I2C_SLEW_POSITION                     equ 0006h
RC1I2C_SLEW_SIZE                         equ 0002h
RC1I2C_SLEW_LENGTH                       equ 0002h
RC1I2C_SLEW_MASK                         equ 00C0h
RC1I2C_TH0_POSN                          equ 0000h
RC1I2C_TH0_POSITION                      equ 0000h
RC1I2C_TH0_SIZE                          equ 0001h
RC1I2C_TH0_LENGTH                        equ 0001h
RC1I2C_TH0_MASK                          equ 0001h
RC1I2C_TH1_POSN                          equ 0001h
RC1I2C_TH1_POSITION                      equ 0001h
RC1I2C_TH1_SIZE                          equ 0001h
RC1I2C_TH1_LENGTH                        equ 0001h
RC1I2C_TH1_MASK                          equ 0002h
RC1I2C_PU0_POSN                          equ 0004h
RC1I2C_PU0_POSITION                      equ 0004h
RC1I2C_PU0_SIZE                          equ 0001h
RC1I2C_PU0_LENGTH                        equ 0001h
RC1I2C_PU0_MASK                          equ 0010h
RC1I2C_PU1_POSN                          equ 0005h
RC1I2C_PU1_POSITION                      equ 0005h
RC1I2C_PU1_SIZE                          equ 0001h
RC1I2C_PU1_LENGTH                        equ 0001h
RC1I2C_PU1_MASK                          equ 0020h
RC1I2C_SLEW0_POSN                        equ 0006h
RC1I2C_SLEW0_POSITION                    equ 0006h
RC1I2C_SLEW0_SIZE                        equ 0001h
RC1I2C_SLEW0_LENGTH                      equ 0001h
RC1I2C_SLEW0_MASK                        equ 0040h
RC1I2C_SLEW1_POSN                        equ 0007h
RC1I2C_SLEW1_POSITION                    equ 0007h
RC1I2C_SLEW1_SIZE                        equ 0001h
RC1I2C_SLEW1_LENGTH                      equ 0001h
RC1I2C_SLEW1_MASK                        equ 0080h

// Register: RC4I2C
#define RC4I2C RC4I2C
RC4I2C                                   equ 01EECh
// bitfield definitions
RC4I2C_TH_POSN                           equ 0000h
RC4I2C_TH_POSITION                       equ 0000h
RC4I2C_TH_SIZE                           equ 0002h
RC4I2C_TH_LENGTH                         equ 0002h
RC4I2C_TH_MASK                           equ 0003h
RC4I2C_PU_POSN                           equ 0004h
RC4I2C_PU_POSITION                       equ 0004h
RC4I2C_PU_SIZE                           equ 0002h
RC4I2C_PU_LENGTH                         equ 0002h
RC4I2C_PU_MASK                           equ 0030h
RC4I2C_SLEW_POSN                         equ 0006h
RC4I2C_SLEW_POSITION                     equ 0006h
RC4I2C_SLEW_SIZE                         equ 0002h
RC4I2C_SLEW_LENGTH                       equ 0002h
RC4I2C_SLEW_MASK                         equ 00C0h
RC4I2C_TH0_POSN                          equ 0000h
RC4I2C_TH0_POSITION                      equ 0000h
RC4I2C_TH0_SIZE                          equ 0001h
RC4I2C_TH0_LENGTH                        equ 0001h
RC4I2C_TH0_MASK                          equ 0001h
RC4I2C_TH1_POSN                          equ 0001h
RC4I2C_TH1_POSITION                      equ 0001h
RC4I2C_TH1_SIZE                          equ 0001h
RC4I2C_TH1_LENGTH                        equ 0001h
RC4I2C_TH1_MASK                          equ 0002h
RC4I2C_PU0_POSN                          equ 0004h
RC4I2C_PU0_POSITION                      equ 0004h
RC4I2C_PU0_SIZE                          equ 0001h
RC4I2C_PU0_LENGTH                        equ 0001h
RC4I2C_PU0_MASK                          equ 0010h
RC4I2C_PU1_POSN                          equ 0005h
RC4I2C_PU1_POSITION                      equ 0005h
RC4I2C_PU1_SIZE                          equ 0001h
RC4I2C_PU1_LENGTH                        equ 0001h
RC4I2C_PU1_MASK                          equ 0020h
RC4I2C_SLEW0_POSN                        equ 0006h
RC4I2C_SLEW0_POSITION                    equ 0006h
RC4I2C_SLEW0_SIZE                        equ 0001h
RC4I2C_SLEW0_LENGTH                      equ 0001h
RC4I2C_SLEW0_MASK                        equ 0040h
RC4I2C_SLEW1_POSN                        equ 0007h
RC4I2C_SLEW1_POSITION                    equ 0007h
RC4I2C_SLEW1_SIZE                        equ 0001h
RC4I2C_SLEW1_LENGTH                      equ 0001h
RC4I2C_SLEW1_MASK                        equ 0080h

// Register: RC5I2C
#define RC5I2C RC5I2C
RC5I2C                                   equ 01EEDh
// bitfield definitions
RC5I2C_TH_POSN                           equ 0000h
RC5I2C_TH_POSITION                       equ 0000h
RC5I2C_TH_SIZE                           equ 0002h
RC5I2C_TH_LENGTH                         equ 0002h
RC5I2C_TH_MASK                           equ 0003h
RC5I2C_PU_POSN                           equ 0004h
RC5I2C_PU_POSITION                       equ 0004h
RC5I2C_PU_SIZE                           equ 0002h
RC5I2C_PU_LENGTH                         equ 0002h
RC5I2C_PU_MASK                           equ 0030h
RC5I2C_SLEW_POSN                         equ 0006h
RC5I2C_SLEW_POSITION                     equ 0006h
RC5I2C_SLEW_SIZE                         equ 0002h
RC5I2C_SLEW_LENGTH                       equ 0002h
RC5I2C_SLEW_MASK                         equ 00C0h
RC5I2C_TH0_POSN                          equ 0000h
RC5I2C_TH0_POSITION                      equ 0000h
RC5I2C_TH0_SIZE                          equ 0001h
RC5I2C_TH0_LENGTH                        equ 0001h
RC5I2C_TH0_MASK                          equ 0001h
RC5I2C_TH1_POSN                          equ 0001h
RC5I2C_TH1_POSITION                      equ 0001h
RC5I2C_TH1_SIZE                          equ 0001h
RC5I2C_TH1_LENGTH                        equ 0001h
RC5I2C_TH1_MASK                          equ 0002h
RC5I2C_PU0_POSN                          equ 0004h
RC5I2C_PU0_POSITION                      equ 0004h
RC5I2C_PU0_SIZE                          equ 0001h
RC5I2C_PU0_LENGTH                        equ 0001h
RC5I2C_PU0_MASK                          equ 0010h
RC5I2C_PU1_POSN                          equ 0005h
RC5I2C_PU1_POSITION                      equ 0005h
RC5I2C_PU1_SIZE                          equ 0001h
RC5I2C_PU1_LENGTH                        equ 0001h
RC5I2C_PU1_MASK                          equ 0020h
RC5I2C_SLEW0_POSN                        equ 0006h
RC5I2C_SLEW0_POSITION                    equ 0006h
RC5I2C_SLEW0_SIZE                        equ 0001h
RC5I2C_SLEW0_LENGTH                      equ 0001h
RC5I2C_SLEW0_MASK                        equ 0040h
RC5I2C_SLEW1_POSN                        equ 0007h
RC5I2C_SLEW1_POSITION                    equ 0007h
RC5I2C_SLEW1_SIZE                        equ 0001h
RC5I2C_SLEW1_LENGTH                      equ 0001h
RC5I2C_SLEW1_MASK                        equ 0080h

