GopalSaraf/Practicals/PSDL/include/proc/pic16f17126.inc
/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec
psect udata_bank3,class=BANK3,space=SPACE_DATA,noexec
psect udata_bank4,class=BANK4,space=SPACE_DATA,noexec
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec
psect udata_bank7,class=BANK7,space=SPACE_DATA,noexec
psect udata_bank8,class=BANK8,space=SPACE_DATA,noexec
psect udata_bank9,class=BANK9,space=SPACE_DATA,noexec
psect udata_bank10,class=BANK10,space=SPACE_DATA,noexec
psect udata_bank11,class=BANK11,space=SPACE_DATA,noexec
psect udata_bank12,class=BANK12,space=SPACE_DATA,noexec
psect udata_bank13,class=BANK13,space=SPACE_DATA,noexec
psect udata_bank14,class=BANK14,space=SPACE_DATA,noexec
psect udata_bank15,class=BANK15,space=SPACE_DATA,noexec
psect udata_bank16,class=BANK16,space=SPACE_DATA,noexec
psect udata_bank17,class=BANK17,space=SPACE_DATA,noexec
psect udata_bank18,class=BANK18,space=SPACE_DATA,noexec
psect udata_bank19,class=BANK19,space=SPACE_DATA,noexec
psect udata_bank20,class=BANK20,space=SPACE_DATA,noexec
psect udata_bank21,class=BANK21,space=SPACE_DATA,noexec
psect udata_bank22,class=BANK22,space=SPACE_DATA,noexec
psect udata_bank23,class=BANK23,space=SPACE_DATA,noexec
psect udata_bank24,class=BANK24,space=SPACE_DATA,noexec
psect udata_bank25,class=BANK25,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC16F17126_INC_
